#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/05471d52-24bf-445f-a02d-e1fa9fa5d903/terraform-bin show -no-color plan.tmp

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_object.redirects[480] will be created
  + resource "aws_s3_object" "redirects" {
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/parameters/on-missing-include.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/parameters/on-missing-include-changelog.html"
    }

  # aws_s3_object.redirects[625] will be created
  + resource "aws_s3_object" "redirects" {
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/extensions/extension-upgrade-guides/home.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "https://contribute.liquibase.com/extensions-integrations/extensions-overview/upgrade-guides/"
    }

  # aws_s3_object.redirects[626] will be created
  + resource "aws_s3_object" "redirects" {
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/extensions/extension-upgrade-guides/lb-2.0-upgrade-guide.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "https://contribute.liquibase.com/extensions-integrations/extensions-overview/upgrade-guides/lb-2.0-upgrade-guide/"
    }

  # aws_s3_object.redirects[627] will be created
  + resource "aws_s3_object" "redirects" {
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/extensions/extension-upgrade-guides/lb-3.0-upgrade-guide.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "https://contribute.liquibase.com/extensions-integrations/extensions-overview/upgrade-guides/lb-3.0-upgrade-guide/"
    }

  # aws_s3_object.redirects[628] will be created
  + resource "aws_s3_object" "redirects" {
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/extensions/extension-upgrade-guides/lb-3.1-upgrade-guide.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "https://contribute.liquibase.com/extensions-integrations/extensions-overview/upgrade-guides/lb-3.1-upgrade-guide/"
    }

  # aws_s3_object.redirects[629] will be created
  + resource "aws_s3_object" "redirects" {
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/extensions/extension-upgrade-guides/lb-3.2-upgrade-guide.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "https://contribute.liquibase.com/extensions-integrations/extensions-overview/upgrade-guides/lb-3.2-upgrade-guide/"
    }

  # aws_s3_object.redirects[630] will be created
  + resource "aws_s3_object" "redirects" {
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/extensions/extension-upgrade-guides/lb-3.3-upgrade-guide.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "https://contribute.liquibase.com/extensions-integrations/extensions-overview/upgrade-guides/lb-3.3-upgrade-guide/"
    }

  # aws_s3_object.redirects[631] will be created
  + resource "aws_s3_object" "redirects" {
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/extensions/extension-upgrade-guides/lb-4.0-upgrade-guide.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "https://contribute.liquibase.com/extensions-integrations/extensions-overview/upgrade-guides/lb-4.0-upgrade-guide/"
    }

Plan: 8 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_s3_object.redirects[480] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/parameters/on-missing-include.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/parameters/on-missing-include-changelog.html"%0A    }%0A%0A  # aws_s3_object.redirects[625] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/tools-integrations/extensions/extension-upgrade-guides/home.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "https://contribute.liquibase.com/extensions-integrations/extensions-overview/upgrade-guides/"%0A    }%0A%0A  # aws_s3_object.redirects[626] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/tools-integrations/extensions/extension-upgrade-guides/lb-2.0-upgrade-guide.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "https://contribute.liquibase.com/extensions-integrations/extensions-overview/upgrade-guides/lb-2.0-upgrade-guide/"%0A    }%0A%0A  # aws_s3_object.redirects[627] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/tools-integrations/extensions/extension-upgrade-guides/lb-3.0-upgrade-guide.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "https://contribute.liquibase.com/extensions-integrations/extensions-overview/upgrade-guides/lb-3.0-upgrade-guide/"%0A    }%0A%0A  # aws_s3_object.redirects[628] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/tools-integrations/extensions/extension-upgrade-guides/lb-3.1-upgrade-guide.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "https://contribute.liquibase.com/extensions-integrations/extensions-overview/upgrade-guides/lb-3.1-upgrade-guide/"%0A    }%0A%0A  # aws_s3_object.redirects[629] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/tools-integrations/extensions/extension-upgrade-guides/lb-3.2-upgrade-guide.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "https://contribute.liquibase.com/extensions-integrations/extensions-overview/upgrade-guides/lb-3.2-upgrade-guide/"%0A    }%0A%0A  # aws_s3_object.redirects[630] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/tools-integrations/extensions/extension-upgrade-guides/lb-3.3-upgrade-guide.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "https://contribute.liquibase.com/extensions-integrations/extensions-overview/upgrade-guides/lb-3.3-upgrade-guide/"%0A    }%0A%0A  # aws_s3_object.redirects[631] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/tools-integrations/extensions/extension-upgrade-guides/lb-4.0-upgrade-guide.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "https://contribute.liquibase.com/extensions-integrations/extensions-overview/upgrade-guides/lb-4.0-upgrade-guide/"%0A    }%0A%0APlan: 8 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>


*Pusher: @sayaliM0412, Action: `pull_request`, Working Directory: `/home/runner/work/liquibase-docs/liquibase-docs`, Workflow: `Publish Redirects to Staging for Docs`*